app/Http/Controllers/BookController.php

select distinct "publication_year" from "books" where "publication_year" is not null order by "publication_year" desc
---
        $books = $query->paginate(12);
        $categories = Category::all();

        $years = Book::whereNotNull('publication_year')
                    ->distinct()
                    ->orderBy('publication_year', 'desc')
                    ->pluck('publication_year');