app/Http/Controllers/BookController.php

select * from "categories" where "categories"."id" in (9, 10)
---
    public function show(Book $book)
    {
        $book->load(['category', 'reviews.user']);

select * from "categories"
---
    public function edit(Book $book)
    {
        $categories = Category::all();