app/Http/Controllers/CategoryController.php

select count(*) as aggregate from "categories"
---
    public function index()
    {
        $categories = Category::withCount('books')->paginate(10);