app/Http/Controllers/DashboardController.php

select count(*) as aggregate from "users"
select count(*) as aggregate from "books"
select count(*) as aggregate from "categories"
select count(*) as aggregate from "orders"
select * from "books" where "books"."id" in (1, 10, 12, 14, 16, 22, 23, 24, 26, 28, 29, 30, 31, 41, 48, 53, 57, 61, 67, 72, 74, 75, 77, 80, 83, 84, 86, 88, 90, 91, 92, 94, 100)
select * from "order_items" where "order_items"."order_id" in (3, 7, 10, 15, 18, 21, 22, 28, 32, 34)
select * from "orders" order by "created_at" desc limit 10
select * from "users" where "users"."id" in (2, 3, 4, 5, 6, 8, 10, 13, 19)
select status, COUNT(*) as count from "orders" group by "status"
select * from "books" where "books"."id" in (18, 36, 37, 58, 78)
select * from "reviews" order by "created_at" desc limit 5
select * from "users" where "users"."id" in (5, 13, 22)
select * from "import_logs" order by "created_at" desc limit 5
select * from "users" where "users"."id" in (1, 2)
select * from "export_logs" order by "created_at" desc limit 5
select * from "backup_monitoring" where "status" = 'success' order by "created_at" desc limit 1
select * from "audits" order by "created_at" desc limit 5
---
    public function admin()
    {
        if (!auth()->user()->isAdmin()) {
            abort(403, 'Access denied. Admin privileges required.');
        }

        $totalUsers      = User::count();
        $totalBooks      = Book::count();
        $totalCategories = Category::count();
        $totalOrders     = Order::count();

        $recentOrders = Order::with(['user', 'orderItems.book'])
            ->latest()->take(10)->get();

        $orderStatusSummary = Order::selectRaw('status, COUNT(*) as count')
            ->groupBy('status')->pluck('count', 'status')->toArray();

        $recentReviews = Review::with(['user', 'book'])
            ->latest()->take(5)->get();

        // Lab 6 additions
        $recentImports   = ImportLog::with('user')->latest()->take(5)->get();
        $recentExports   = ExportLog::with('user')->latest()->take(5)->get();
        $lastBackup      = BackupMonitoring::where('status', 'success')->latest()->first();
        $recentAuditLogs = Audit::with('user')->latest()->take(5)->get();