app/Http/Controllers/HomeController.php

    public function index()
    {
        $featuredBooks = Book::with('category')
            ->orderBy('created_at', 'desc')
            ->take(8)
            ->get();

        $heroBook = Book::whereNotNull('cover_image')->latest()->first() ?? $featuredBooks->first();
        $categories = Category::withCount('books')->orderByDesc('books_count')->get();
---
select * from "categories" where "categories"."id" in (1, 4, 5, 6, 8, 9, 10)
select "categories".*, (select count(*) from "books" where "categories"."id" = "books"."category_id") as "books_count" from "categories"