app/Models/LoginLog.php

    public static function logAttempt($email, $successful = false, $user = null, $failureReason = null)
    {
        return static::create([
            'user_id' => $user ? $user->id : null,
            'email' => $email,
            'ip_address' => request()->ip(),
            'user_agent' => request()->userAgent(),
            'successful' => $successful,
            'failure_reason' => $failureReason,
        ]);
---
insert into "login_logs" ("user_id", "email", "ip_address", "user_agent", "successful", "failure_reason", "updated_at", "created_at") values (1, 'aaronclydeccervantes@gmail.com', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Code/1.119.0 Chrome/142.0.7444.265 Electron/39.8.8 Safari/537.36', 1, null, '2026-05-12 06:20:52', '2026-05-12 06:20:52')