app/Models/User.php

update "users" set "last_login_at" = '2026-05-12 06:20:52', "last_login_ip" = '127.0.0.1', "updated_at" = '2026-05-12 06:20:52' where "id" = 1
---
    public function updateLoginInfo()
    {
        $this->update([
            'last_login_at' => now(),
            'last_login_ip' => request()->ip(),
        ]);